{
  "MainScreenInfo": {
    "ProfessionalProjects": [
      {
        "name": "CASE IH - Virtual Training",
        "description": "is a virtual assembly line training made for the Italian multinational company CNH.",
        "fullDescription": "The project is a virtual training using the HTC Vive Cosmos, developed for the company of agricultural machinery and equipment Case IH, whose objective is to train new employees in two of the main assembly lines of the factory. In this project, I was responsible for developing the entire gameplay flow, from the assembling of the parts to the REST API integration responsible for recording user actions.",
        "thumbUrl": "cnhPiracicaba",
        "videoUrl": "k4WlDbxqKy8",
        "tags": [
          "Unity",
          "C#",
          "VR",
          "3D"
        ],
        "contributions": [
          "Game Flow Programming",
          "Rest API Integration",
          "Interactions"
        ],
        "categories": [
          "Virtual Training"
        ],
        "platforms": [
          "PC","HTC Vive"
        ],
        "engine": "Unity",
        "languages": [
          "C#"
        ],
        "access": []
      },
      {
        "name": "DPR - VR Experience",
        "description": "is a virtual reality experience that aims to present the products and solutions of the telecommunications company DPR.",
        "fullDescription": "This project was created for presentation at the ABRINT 2021 event (Associação Brasileira de Provedores de Internet e Telecomunicações. Eng: Brazilian Association of Internet and Telecommunications Providers) for the telecommunication company DPR. The goal was to show some of the company's main products through a VR experience where the user can climb a ladder and interact with the equipment responsible for delivering internet to customers' homes. The difference in the experience is that when the customer's internet is disconnected in the VR, the event's stand's internet is also disconnected and so is when it is connected again. The project was developed for the HTC Vive and I was responsible for developing the entire flow of the experience, as well as the interaction with the event's modem through a bluetooth connection.",

        "thumbUrl": "dprVR",
        "videoUrl": "qb3H7abv2lw",
        "tags": [
          "Unity",
          "C#",
          "VR",
          "3D"
        ],
        "contributions": [
          "Game Flow Programming",
          "Interactions using Steam VR SDK",
          "Bluetooth Arduino Integration"
        ],
        "categories": [
          "VR Experience"
        ],
        "platforms": [
          "PC","HTC Vive"
        ],
        "engine": "Unity",
        "languages": [
          "C#"
        ],
        "access": []
      },
      {
        "name": "Button Soccer Arena",
        "description": "is a casual game that brings the nostalgia of classic button football to mobile screens.",
        "fullDescription": "This is one of the projects developed in partnership with the Brazilian television station SBT. The goal is to bring the nostalgia of button football games to mobile screens. In it, I was responsible for developing the gameplay mechanics, such as button interaction, game flow and online multiplayer mechanics using Photon. I was also responsible for the integration with Google Play Services and Apple Auth, as well as the integration with PlayFab for the user's authentication and saving of the data in the cloud.",
        "thumbUrl": "buttonSoccer",
        "videoUrl": "K35cm2dnQjU",
        "tags": [
          "Unity",
          "C#",
          "Mobile",
          "3D"
        ],
        "contributions": [
          "Gameplay Mechanics",
          "Multiplayer",
          "Play Game Services and Apple Login",
          "PlayFab Integration"
        ],
        "categories": [
          "Casual"
        ],
        "platforms": [
          "Mobile"
        ],
        "engine": "Unity",
        "languages": [
          "C#"
        ],
        "access": [
          {
            "type": 0,
            "url": "https://play.google.com/store/apps/details?id=com.liga.buttonsoccerarena"
          },
          {
            "type": 1,
            "url": "https://apps.apple.com/us/app/button-soccer-arena/id1586875589"
          }
        ]
      },
      {
        "name": "Road Star",
        "description": "is a 3D mobile racing game with slot car mechanics based on the famous Brazilian rock band Mamonas Assassinas.",
        "fullDescription": "This game that is in the development stage is a racing game with slot car mechanics and based on the famous Brazilian rock band Mamonas Assassinas. On it, you can play the story mode, unlock new vehicles as you beat your opponents, play musical minigames with the band's original sound tracks, install upgrades and unlock stickers for customization. I was responsible for developing the gameplay mechanics, minigames, implementing the UI, implementing the animations, optimizing memory usage through Unity's addressable system and developing a level editor for creating new tracks.",
        "thumbUrl": "roadstar",
        "videoUrl": "hTTvhTgjJi0",
        "tags": [
          "Unity",
          "C#",
          "Mobile",
          "3D"
        ],
        "contributions": [
          "Gameplay Mechanics",
          "Level Editor",
          "Implementation of Animations",
          "Optimization"
        ],
        "categories": [
          "Casual"
        ],
        "platforms": [
          "Mobile"
        ],
        "engine": "Unity",
        "languages": [
          "C#"
        ],
        "access": [
        ]
      },
      {
        "name": "Heróis da Pandemia",
        "description": "seeks through a playful way to pass prevention guidelines to COVID-19 following the recommendations of the brazilian Ministry of Health.",
        "fullDescription": "This project was developed in less than a month at the beginning of the COVID-19 pandemic in 2020 and its objective is to pass, in a playful and fun way, prevention guidelines to teach how to protect yourself from the virus. It has seven minigames, each with the goal of teaching a way of prevention for the virus, such as social distancing, hand hygiene, use of masks and others. I was responsible for porting the game to Web GL, by doing the necessary configurations and optimizations, integrating the Facebook SDK for login and saving the user's score and also for the development of the online ranking through the use of a REST API.",
        "thumbUrl": "heroispandemia",
        "videoUrl": "BFVoce8NCRg",
        "tags": [
          "Unity",
          "C#",
          "JavaScript",
          "Web GL"
        ],
        "contributions": [
          "Web GL port",
          "Facebook Integration",
          "Ranking",
          "Optimization"
        ],
        "categories": [
          "Casual",
          "Educational"
        ],
        "platforms": [
          "Mobile",
          "Web"
        ],
        "engine": "Unity",
        "languages": [
          "C#",
          "JavaScript"
        ],
        "access": [
          {
            "type": 2,
            "url": "https://heroisdapandemia.com.br"
          }
        ]
      },
      {
        "name": "Joy & Toy",
        "description": "it is a 2D sidescroller runner mixed with a lane-runner style game akin to Sonic based on a famous brazilian children's tv series.",
        "fullDescription": "This was the first game developed in partnership with the Brazilian television station SBT and was based on the soap opera 'As Aventuras de Poliana' (The Poliana Adventures). It is a 2D sidescroller runner in which the objective is to reach all the children in the level to make them happy and reach the end of the level before the energy runs out. I was responsible for developing the main gameplay mechanics such as characters movement and implementing their animations, collecting energy orbs and interacting with children. I was also responsible for optimizing the project, as one of our goals was to make it possible to play the game on as many devices as possible.",
        "thumbUrl": "joytoy",
        "videoUrl": "j5FWzn5U_5k",
        "tags": [
          "Unity",
          "C#",
          "Mobile",
          "2D"
        ],
        "contributions": [
          "Gameplay Mechanics",
          "Implementation of Animations",
          "Optimization"
        ],
        "categories": [
          "Casual"
        ],
        "platforms": [
          "Mobile"
        ],
        "engine": "Unity",
        "languages": [
          "C#"
        ],
        "access": [
          {
            "type": 0,
            "url": "https://play.google.com/store/apps/details?id=com.liga.polianasbtjoytoy"
          },
          {
            "type": 1,
            "url": "https://apps.apple.com/br/app/aventuras-de-poliana-joy-toy/id1481899470"
          }
        ]
      },
      {
        "name": "Trader Life",
        "description": "is a 2D/3D game in which its goal is to make newcomers to the trade business feel more comfortable with dealing with all the brokerage jargon and applications that may sometimes seem daunting.",
        "fullDescription": "This game was developed for the company specialized in short-term operations in the financial market Atom S/A. The purpose of the game is to be, in a playful and fun way, a gateway for those interested in this world of investments and day trade. I was responsible for basically all the game's programming, like the trading minigames, the house and character mechanics, tutorials, Facebook integration, integration with a REST API and localization for other languages.",
        "thumbUrl": "traderlife",
        "videoUrl": "ABu2Ryy1gd8",
        "tags": [
          "Unity",
          "C#",
          "Mobile",
          "2D",
          "3D"
        ],
        "contributions": [
          "Trade Minigames",
          "In House Gameplay",
          "Tutorials",
          "Facebook Integration",
          "Ranking",
          "Localization"
        ],
        "categories": [
          "Casual",
          "Educational"
        ],
        "platforms": [
          "Mobile"
        ],
        "engine": "Unity",
        "languages": [
          "C#"
        ],
        "access": [
          {
            "type": 0,
            "url": "https://play.google.com/store/apps/details?id=com.liga.traderlife"
          },
          {
            "type": 1,
            "url": "https://apps.apple.com/br/app/traders-life/id1475175020"
          }
        ]
      },
      {
        "name": "Quintal Uirapuru",
        "description": "it's an yard management game made to Colégio Uirapuru where your goal is to stimulate, in a playful way, the reinforcement of the subjects passed in class through exercises and puzzles.",
        "fullDescription": "This was one the first games that i worked as a professional developer. I was responsible for the development of the game in its initial phase, creating the basis for another developer to take over the development, I was responsible for developing the tile system and the movement system for the farm animals, applying the A* pathfinding algorithm.",
        "thumbUrl": "uirapuru",
        "videoUrl": "pSui2hxCLVo",
        "tags": [
          "Unity",
          "C#",
          "Mobile",
          "AR"
        ],
        "contributions": [
          "Tiles Editing System",
          "Animals Pathfinding Movement"
        ],
        "categories": [
          "Casual",
          "Educational"
        ],
        "platforms": [
          "Mobile"
        ],
        "engine": "Unity",
        "languages": [
          "C#"
        ],
        "access": [
        ]
      },
      {
        "name": "Senninha AR",
        "description": "it's an AR experience based on the children's book 'Senninha - In the World of Enchanted Words'.",
        "fullDescription": "This project was developed in partnership with the Ayrton Senna Institute. It is an augmented reality experience with the goal of increasing the child's immersion in reading the book 'Senninha - In the World of Enchanted Words'.",
        "thumbUrl": "senninhaAR",
        "videoUrl": "0AUMZ5sq_sg",
        "tags": [
          "Unity",
          "C#",
          "Mobile",
          "AR"
        ],
        "contributions": [
          "AR Interaction"
        ],
        "categories": [
          "AR Experience"
        ],
        "platforms": [
          "Mobile"
        ],
        "engine": "Unity",
        "languages": [
          "C#"
        ],
        "access": [
        ]
      }
    ],
    "PersonalProjects": []
  }
}
